Revit 2027 API
FabricationServiceButton.ConditionCount Property
 The number of conditions.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int ConditionCount { get; }
Public ReadOnly Property ConditionCount As Integer
	Get
public:
property int ConditionCount {
	int get ();
}
member ConditionCount : int with get
Property Value
Int32
See Also
Reference
FabricationServiceButton Class
Autodesk.Revit.DB Namespace